"""철수의 토마토 농장에서는 토마토를 보관하는 큰 창고를 가지고 있다. 토마토는 아래의 그림과 같이 격자 모양 상자의 칸에 하나씩 넣어서 창고에 보관한다.
창고에 보관되는 토마토들 중에는 잘 익은 것도 있지만, 아직 익지 않은 토마토들도 있을 수 있다. 보관 후 하루가 지나면,
익은 토마토들의 인접한 곳에 있는 익지 않은 토마토들은 익은 토마토의 영향을 받아 익게 된다.
하나의 토마토의 인접한 곳은 왼쪽, 오른쪽, 앞, 뒤 네 방향에 있는 토마토를 의미한다.
대각선 방향에 있는 토마토들에게는 영향을 주지 못하며, 토마토가 혼자 저절로 익는 경우는 없다고 가정한다.
철수는 창고에 보관된 토마토들이 며칠이 지나면 다 익게 되는지, 그 최소 일수를 알고 싶어 한다.
토마토를 창고에 보관하는 격자모양의 상자들의 크기와 익은 토마토들과 익지 않은 토마토들의 정보가 주어졌을 때, 며칠이 지나면 토마토들이 모두 익는지,
그 최소 일수를 구하는 프로그램을 작성하라. 단, 상자의 일부 칸에는 토마토가 들어있지 않을 수도 있다."""
# 입력 : 첫 줄에는 상자의 크기를 나타내는 두 정수 M,N이 주어진다. M은 상자의 가로 칸의 수, N은 상자의 세로 칸의 수를 나타낸다.
# 단, 2 ≤ M,N ≤ 1,000 이다. 둘째 줄부터는 하나의 상자에 저장된 토마토들의 정보가 주어진다. 즉, 둘째 줄부터 N개의 줄에는 상자에 담긴 토마토의 정보가 주어진다.
# 하나의 줄에는 상자 가로줄에 들어있는 토마토의 상태가 M개의 정수로 주어진다.
# 정수 1은 익은 토마토, 정수 0은 익지 않은 토마토, 정수 -1은 토마토가 들어있지 않은 칸을 나타낸다.
# 토마토가 하나 이상 있는 경우만 입력으로 주어진다.
# 출력 : 여러분은 토마토가 모두 익을 때까지의 최소 날짜를 출력해야 한다.
# 만약, 저장될 때부터 모든 토마토가 익어있는 상태이면 0을 출력해야 하고, 토마토가 모두 익지는 못하는 상황이면 -1을 출력해야 한다.


""" 핵심 : bfs에 초기 토마토의 위치를 다 넣어주고 시작해야한다.
기존 bfs코드대로 돌리면, 토마토 하나에 대해 최대치로 다 뻗어나가게 한 후 그 다음 토마토가 주변 토마토들로 뻗어나간다.
이렇게 되면, 비교를 한 번 더 해줘야한다. ( X번 토마토까지 익게하는 시간이 1번 토마토는 10일이어서 10이라는 숫자가 X번 위치에 저장
되어있는데, 2번 토마토는 X번 토마토까지 거리가 7일이라면, 7로 바꿔줘야한다. 이러한 과정은 쌓이고 쌓일수록 메모리와 시간을 잡아먹는다.
따라서 생각해낸 것이 bfs에서 deque를 생성할 때, 초기의 익은 토마토 위치를 모두 q에 넣고 시작하면 모든 위치에서 일정하게 뻗어나간다! """
import sys
from collections import deque

m, n = map(int, input().rstrip().split())
box = []
for _ in range(n):
    box.append(list(map(int, input().rstrip().split())))

dx = [-1, 0, 1, 0]
dy = [0, 1, 0, -1]
ones = []
for i in range(n):
    for j in range(m):
        if box[i][j] == 1:
            ones.append((i, j))


def bfs():
    q = deque([])
    q += ones
    while q:
        nowx, nowy = q.popleft()
        for i in range(4):
            nx = nowx + dx[i]
            ny = nowy + dy[i]
            if nx < 0 or ny < 0 or nx >= n or ny >= m:
                continue
            if box[nx][ny] == 0:
                box[nx][ny] = box[nowx][nowy] + 1
                q.append((nx, ny))


bfs()

a = sum(i.count(0) for i in box)
if a != 0:
    print(-1)
else:
    print(max(max(i) for i in box) - 1)