""" 일직선상의 마을에 여러 채의 집이 있다. 이 중, 특정 위치의 집에 특별히 한 개의 안테나를 설치하기로 했다.
효율성을 위해 안테나로부터 모든 집까지의 거리의 총 합이 죄소가 되도록 하려 한다. 이 때, 안테나는 집이 위치한 곳에만설치할 수 있고, 논리적으로 동일한 위치에 여러개의 집이 존재하는 거이 가능하다.
집들의 위치 값이 주어질 때, 안테나를 설치할 위치를 선택하는 프로그램을 작성하라.
예를 들어 N = 4이고, 각 위치가 1,5,7,9 일 때를 가정하자

이 경우 5의 위치에 설치했을 때, 안테나로부터 모든 집까지의 거리의 총합이 (4+0+2+4) = 10으로 최소가 됩니다. """
# 첫 째 줄에 집의 수 N이 자연수로 주어진다.
# 둘 째 줄에 N채의 집에 위치가 공백으로 구분되어 1 이상 100,000이하의 자연수로 주어진다.
# 출력 - 첫 째 줄에 안테나를 설치할 위치의 값을 출력한다. 단, 안테나를 설치할 수 있는 위치 값으로 여러개의 값이 도출될 경우, 가장 작은 값을 출력한다.

n = int(input())
house = list(map(int, input().split()))
house.sort()

if n % 2 == 1:
    print(house[n//2])
else:
    print(house[n//2 - 1])

# 이 두 4줄을 간단히 줄여,
"""   print(house[(n-1)//2] 로 표현 가능하다.   """