# 그래프는 Node와 Edge로 표현됨.
'''이를 데이터로 나타내는 방법은 2가지.
        1. 인접 행렬 ( Adjacency Matrix ) -> 2차원배열로. 노드(Vertex)가 n개라면, n x n 크기의 2차원 배열.
            - > 자기 자신에는 0, 인접하지 않았다면 INF로 표시 '''
#  인접행렬 방식은 배열 크기가 너무 커서 메모리 낭비.
    #but 정보를 얻어오는 속도는 빠르다!


''' 2. 인접 리스트 ( Adajcency List )  -> 연결된 간선의 정보 표시해준다고 생각하면 됨. (인접한 노드번호, 간선길이 ) 쌍으로!'''
# 인접 행렬 방식에 비해, 존재하는 간선에 대해서만 저장하므로, 메모리 효율적!
    #but 정보를 얻어오는 속도는 인접 리스트 방식이 더 느리다.

"""DFS는 stack에 기초한다"""

'''DFS의 각 node는 자기 인접 노드들이 모두 방문처리될 때까지 stack 안에 남아있는다! 
      -> 1. 탐색 시작 노드를 스택에 삽입 + 방문처리 
         2. 스택 최상단 노드에 방문하지 않은 인접노드가 있다면, 그 인접노드를 스택에 넣고 방문처리. 방문x 인접노드 없으면 꺼냄.
         3. 2번을 수행 불가까지 반복'''


