'''한 마을에 모험가 n명 있다. 모험가는 '공포도' 측정을 하여 공포도가 높으면 상황대처능력이 떨어진다고 평가된다.
모험가 길드를 안전하게 구성하고자 공포도가 x인 모험가는 반드시 x명 이상으로 구성한 모험가 그룹에 참여해야 여행을 떠날 수 있다.
N명의 모험가에 대한 정보가 주어졌을 때, 여행을 떠날  수 있는 그룹수의 최댓값을 구하는 프고그램을 작성하세요'''
# 모든 모험가가 떠날 필요는 없다. 몇 명의 모험가는 마을에 그대로 남아있어도 된다.

# 첫 째 줄에 모험가의 수 N이 주어진다.
# 둘 쨰 줄에 각 모험가의 공포도의 값을 N 이하의 자연수로 입력, 각 자연수는 공백으로 구분함.
# 출력 - 여행을 떠날 수 있는 그룹 수의 최댓값을 출력한다.

n = int(input())
array = list(map(int, input().split()))

array = sorted(array)
count = 1
group = 0
for i in range(n):
    if count >= array[i]:
        count -= array[i]
        group += 1
    else:
        count += 1


print(group)

