""" 다솜이는 0과 1로만 이루어진 문자열 S를 갖고있다. 다솜이는 문자열 S에 있는 모든 숫자를 전부 같게 만들려고 한다. 로
다솜이가 할 수 있는 행동은 S에서 연속된 하나 이상의 숫자를 잡고 모두 뒤집는 것이다. 뒤집는 것은 1을 0으로, 0을 1로 바꾸는 것을 의미한다.
예로, 0001100은 1. 전체를 뒤집으면 1110011이 된다.
              2. 4,5번만 뒤집으면 1111111이 된다.  이렇게 총 2번!

하지만 처음부터 4,5번만 뒤집으면 모두 0 이 되어, 한번만에 모두 같은 숫자로 바꿀 수 있다.
문자열 S가 주어졌을 때, 다솜이가 해야하는 행동의 최소 횟수를 출력하라. """
# 입력 - 첫째줄에 0과 1로만 이루어진 문자열 S가 주어진다. S길이는 100만보다 작다
#첫쨰 줄에 다솜이가 해야하는 행동의 최소 횟수를 출력한다.

s = list(input())
count = 0

for i in range(1,len(s)):
    if s[i] != s[i-1]:
        count += 1

print((count+1)//2)