"""동네 편의점 주인이 N개의 동전을 갖고있따. 이 때, N개의 동전을 이용하여 만들 수 없는 양의 정수 금액 중 최솟값을 구하는 프로그램을 작성하세요.
예를 들어, N = 5이고, 각 동전이 3,2,1,1원, 9원( 화폐 단위 ) 동전이라고 가정할 떄, 만들 수 없는 양의 정수 금액 중 최솟 값은 8원이다.
또 다른 예시로, N =3이고, 각 동전이 3,5,7원짜리일떄, 만들 수 없는 양의 정수 금액 중 최솟값은 1원이다."""

# 첫 째 줄에는 동전의 개수를 나타내는 양의 정수 N이 주어진다.( 1<= N <= 1000 )
# 둘 째 줄에는 각 동전의 화폐 단위를 나타내는 N개의 자연수가 주어지며, 각 자연수는 공백으로 구분한다. ( 각 화폐단위는 1,000,000 이하 자연수 )
# 출력 - 첫 째 줄에 주어진 동전들로 만들 수 없는 양의 정수 금액 중 최솟값을 출력합니다.

n = int(input())
unit = list(map(int,input().split()))

unit.sort()
section_total = unit[0]

for i in unit[1:]:
    if section_total + 1 < i:
        break
    else:
        section_total += i

print(section_total + 1)
