"""45656이란 수를 보자.

이 수는 인접한 모든 자리수의 차이가 1이 난다. 이런 수를 계단 수라고 한다.

세준이는 수의 길이가 N인 계단 수가 몇 개 있는지 궁금해졌다.

N이 주어질 때, 길이가 N인 계단 수가 총 몇 개 있는지 구하는 프로그램을 작성하시오. (0으로 시작하는 수는 없다.)"""
# 입력 : 첫째 줄에 N이 주어진다. N은 1보다 크거나 같고, 100보다 작거나 같은 자연수이다.
# 출력 : 첫째 줄에 정답을 1,000,000,000으로 나눈 나머지를 출력한다.



''' 점화식 파악이 포인트였던 문제 - 3자리 계단 수 중 3으로 끝나는 것은, 2자리 계단수 중 2혹은4로 끝나는 것에 이어붙이면 되는 것이므로, dp테이블 상에서,
 양쪽 대각선 위에 있는 것들을 합해주면 되는 것'''
n = int(input())
if n == 1:
    print(9)
    exit()
elif n == 2:
    print(17)
    exit()

data = [[0] * 10 for _ in range(n + 1)]

data[1] = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1]
data[2] = [1, 1, 2, 2, 2, 2, 2, 2, 2, 1]

for i in range(3, n + 1):
    for j in range(0, 10):
        if j == 0:
            data[i][j] = data[i - 1][j + 1]
        elif j == 9:
            data[i][j] = data[i - 1][j - 1]
        else:
            data[i][j] = data[i - 1][j - 1] + data[i - 1][j + 1]

print(sum(data[n]) % int(1e9))


